blog/2018.org
#+SETUPFILE: ../setup.org
#+TITLE: 2018年の進捗まとめ

#+BEGIN_LOCATION
@@html:https://<a href="/">bydriv.github.io</a>/<a href="/blog">blog</a>/<strong>2018.html</strong>@@
#+END_LOCATION

#+BEGIN_CREATED_AT
created at @@html:<time datetime="2018-12-29">2018-12-29</time>@@
#+END_CREATED_AT

#+BEGIN_UPDATED_AT
updated at @@html:<time datetime="2018-12-29">2018-12-29</time>@@
#+END_UPDATED_AT

年の瀬ということで， 2018年の進捗をまとめたいと思う．
まえの記事: [[./2018-11-01.org][2019年の準備]]

* 2018年の抱負

2018年のはじめに，わたしはいくつか目標を立てていた．

- ゲームを開発すること．
- コンパイラを開発すること．
- 同人活動を始めること．

ゲームとコンパイラはもともとやりたいこととしてあったし，それとはべつに，同人活動もしてみたいと思っていた．

同人活動は，できればプログラムを書く能力を活かせる分野がよかった．
ゲームを開発して頒布できればそれがいちばんよかったのだが，次点として，技術同人誌を書くということも考えていた．

結論からいえば，これらすべて12月末の時点で達成できたので，よかったと思う．

* 2018年1月

[[./hsyacc.org][HsYACC/HsLex]] を開発していた．

これは，最新コンパイラ構成技法や正規表現技術入門といった書籍を参照しつつ書いた．

* 2018年2月

[[https://github.com/bydriv/mhc][MHC]] という処理系の開発の一環として， HsYACC/HsLex を使用して Haskell 2010 の[[https://github.com/bydriv/mhc/blob/master/Language/Haskell2010/Lexing.hsl][字句解析器]]や[[https://github.com/bydriv/mhc/blob/master/Language/Haskell2010/Parsing.hsy][構文解析器]]を書いていた．

(MHC 自体は，結局ぜんぜんできていないのだが……)

* 2018年3月

ゲーム開発のために必要になりそうな OpenGL の勉強をしていた．

そのときの成果物は， (いまのところ) [[https://github.com/bydriv/bydriv.github.io/blob/master/game/hijack3/src/hijack/platform/windows.c]] に置いてある．

これは3月に書いていたものを12月になって公開したもの．

* 2018年4月

趣味で開発している言語の仕様を書いたりしていたようだ (まだ満足できる仕様が書けていないので公開したわけではないのだが……)

* 2018年5月

このころから進捗あるようになった気がする．

まず， [[./../novel/golden-record.org][黄金録]] を書きはじめた．
5月中旬に書きはじめ，完成は6月中旬になるだろうと予想していた．

* 2018年6月

[[./../novel/golden-record.org][黄金録]] が完結した．
だいたいスケジュール通りの進捗具合だった．

* 2018年7月

[[https://github.com/wejournal/lamb][Lamb]] を開発していた．
この時点で今年の目標のひとつ，コンパイラを書くことは達成したと言ってもよかろうなのだ．

* 2018年8月

なんか SS を大量に書いていたようだ．

* 2018年9月

[[./hijack-dev.org][Hijack のプロトタイプ]] ができた．

いまごろプロトタイプなんて進捗ダメすぎませんか（ひどい）．

しかし，もともとドット絵が大きすぎてドット絵を用意するのにリソース割かれすぎていたので，ドット絵を小さくしてリブートする感じなので，これは必要な段階だったのだと認識している．

プロトタイプとはいえ，いちおうゲームとして認識できる状態ではあると思う．

なので，今年の目標のひとつ，ゲームを開発することも達成したと言ってもよかろうなのだ（？）．

* 2018年10月

[[./tbf5.org][技術書典5にサークル参加した]]．

この時点で今年の目標のひとつである同人活動を始めることは達成できたのでよかった．

* 2018年11月

なんか内定をもらったようだ（進捗あります）．

* 2018年12月

ひたすら仕事をしていた気がする．

あと，休日や電車内で [[https://bydriv.github.io/game/hijack3/][Hijack]] の開発を進めることができた．
かなり進捗あったと思う．

* 2019年の抱負

まえまえからつぶやいている気がするけど， 2019年にやりたいことはもう決まっていて，
それは仕事をしながら Hijack の開発を進めたいということ．

できれば完成させたい気はするけど，1年で完成させられる自信がないというか不可能に思える……．

言語開発欲は最近はあんまない． Lamb を開発して満足してしまったのかもしれない．
あと，言語仕様はともかくクロスコンパイルとかのツールチェインを用意したり実用的なレベルまで最適化する時間も体力もわたしにはないし，
いまある処理系を使うのがやっぱ最適解なんじゃないかというつまらない結論に落ちついている．

まあかと言って言語処理系を開発するのはやっぱ楽しいし時間ができたらまたすると思う．
ただ実用目的だと有限に時間が必要なので個人でやるのは無謀で（当然），
どっちかというと理論的側面を重視してやったほうがおもしろいものができるんじゃないかという気がしている．

ただ1年に両方やるというのはn兎になりがちなので2019年はゲーム開発重点でゆきたい．

Hijack の開発については，具体的になにをどこまで進めるとかはあんま考えてないし，いま考えてもしょうがないことに思える．
とりあえず，仕事と趣味を両立できたらいいね，くらいの目標．
