blog/2018.html
<!DOCTYPE html>
<html>
<head>
<title>2018年の進捗まとめ</title>
<!-- 2019-01-06 Sun 07:24 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/prelude.css" />
<link rel="stylesheet" type="text/css" href="/css/highlight.css" />
</head>
<body>
<div id="content">
<h1 class="title">2018年の進捗まとめ</h1>
<div class="location">
<p>
https://<a href="/">bydriv.github.io</a>/<a href="/blog">blog</a>/<strong>2018.html</strong>
</p>

</div>

<div class="created_at">
<p>
created at <time datetime="2018-12-29">2018-12-29</time>
</p>

</div>

<div class="updated_at">
<p>
updated at <time datetime="2018-12-29">2018-12-29</time>
</p>

</div>

<p>
年の瀬ということで， 2018年の進捗をまとめたいと思う．
まえの記事: <a href="./2018-11-01.html">2019年の準備</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">2018年の抱負</h2>
<div class="outline-text-2" id="text-1">
<p>
2018年のはじめに，わたしはいくつか目標を立てていた．
</p>

<ul class="org-ul">
<li>ゲームを開発すること．
</li>
<li>コンパイラを開発すること．
</li>
<li>同人活動を始めること．
</li>
</ul>

<p>
ゲームとコンパイラはもともとやりたいこととしてあったし，それとはべつに，同人活動もしてみたいと思っていた．
</p>

<p>
同人活動は，できればプログラムを書く能力を活かせる分野がよかった．
ゲームを開発して頒布できればそれがいちばんよかったのだが，次点として，技術同人誌を書くということも考えていた．
</p>

<p>
結論からいえば，これらすべて12月末の時点で達成できたので，よかったと思う．
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">2018年1月</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="./hsyacc.html">HsYACC/HsLex</a> を開発していた．
</p>

<p>
これは，最新コンパイラ構成技法や正規表現技術入門といった書籍を参照しつつ書いた．
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">2018年2月</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://github.com/bydriv/mhc">MHC</a> という処理系の開発の一環として， HsYACC/HsLex を使用して Haskell 2010 の<a href="https://github.com/bydriv/mhc/blob/master/Language/Haskell2010/Lexing.hsl">字句解析器</a>や<a href="https://github.com/bydriv/mhc/blob/master/Language/Haskell2010/Parsing.hsy">構文解析器</a>を書いていた．
</p>

<p>
(MHC 自体は，結局ぜんぜんできていないのだが……)
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">2018年3月</h2>
<div class="outline-text-2" id="text-4">
<p>
ゲーム開発のために必要になりそうな OpenGL の勉強をしていた．
</p>

<p>
そのときの成果物は， (いまのところ) <a href="https://github.com/bydriv/bydriv.github.io/blob/master/game/hijack/src/hijack/platform/windows.c">https://github.com/bydriv/bydriv.github.io/blob/master/game/hijack/src/hijack/platform/windows.c</a> に置いてある．
</p>

<p>
これは3月に書いていたものを12月になって公開したもの．
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">2018年4月</h2>
<div class="outline-text-2" id="text-5">
<p>
趣味で開発している言語の仕様を書いたりしていたようだ (まだ満足できる仕様が書けていないので公開したわけではないのだが……)
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">2018年5月</h2>
<div class="outline-text-2" id="text-6">
<p>
このころから進捗あるようになった気がする．
</p>

<p>
まず， <a href="./../novel/golden-record.html">黄金録</a> を書きはじめた．
5月中旬に書きはじめ，完成は6月中旬になるだろうと予想していた．
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">2018年6月</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="./../novel/golden-record.html">黄金録</a> が完結した．
だいたいスケジュール通りの進捗具合だった．
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">2018年7月</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="https://github.com/wejournal/lamb">Lamb</a> を開発していた．
この時点で今年の目標のひとつ，コンパイラを書くことは達成したと言ってもよかろうなのだ．
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">2018年8月</h2>
<div class="outline-text-2" id="text-9">
<p>
なんか SS を大量に書いていたようだ．
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">2018年9月</h2>
<div class="outline-text-2" id="text-10">
<p>
<a href="./hijack-dev.html">Hijack のプロトタイプ</a> ができた．
</p>

<p>
いまごろプロトタイプなんて進捗ダメすぎませんか（ひどい）．
</p>

<p>
しかし，もともとドット絵が大きすぎてドット絵を用意するのにリソース割かれすぎていたので，ドット絵を小さくしてリブートする感じなので，これは必要な段階だったのだと認識している．
</p>

<p>
プロトタイプとはいえ，いちおうゲームとして認識できる状態ではあると思う．
</p>

<p>
なので，今年の目標のひとつ，ゲームを開発することも達成したと言ってもよかろうなのだ（？）．
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">2018年10月</h2>
<div class="outline-text-2" id="text-11">
<p>
<a href="./tbf5.html">技術書典5にサークル参加した</a>．
</p>

<p>
この時点で今年の目標のひとつである同人活動を始めることは達成できたのでよかった．
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">2018年11月</h2>
<div class="outline-text-2" id="text-12">
<p>
なんか内定をもらったようだ（進捗あります）．
</p>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">2018年12月</h2>
<div class="outline-text-2" id="text-13">
<p>
ひたすら仕事をしていた気がする．
</p>

<p>
あと，休日や電車内で <a href="https://bydriv.github.io/game/hijack/">Hijack</a> の開発を進めることができた．
かなり進捗あったと思う．
</p>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">2019年の抱負</h2>
<div class="outline-text-2" id="text-14">
<p>
まえまえからつぶやいている気がするけど， 2019年にやりたいことはもう決まっていて，
それは仕事をしながら Hijack の開発を進めたいということ．
</p>

<p>
できれば完成させたい気はするけど，1年で完成させられる自信がないというか不可能に思える……．
</p>

<p>
言語開発欲は最近はあんまない． Lamb を開発して満足してしまったのかもしれない．
あと，言語仕様はともかくクロスコンパイルとかのツールチェインを用意したり実用的なレベルまで最適化する時間も体力もわたしにはないし，
いまある処理系を使うのがやっぱ最適解なんじゃないかというつまらない結論に落ちついている．
</p>

<p>
まあかと言って言語処理系を開発するのはやっぱ楽しいし時間ができたらまたすると思う．
ただ実用目的だと有限に時間が必要なので個人でやるのは無謀で（当然），
どっちかというと理論的側面を重視してやったほうがおもしろいものができるんじゃないかという気がしている．
</p>

<p>
ただ1年に両方やるというのはn兎になりがちなので2019年はゲーム開発重点でゆきたい．
</p>

<p>
Hijack の開発については，具体的になにをどこまで進めるとかはあんま考えてないし，いま考えてもしょうがないことに思える．
とりあえず，仕事と趣味を両立できたらいいね，くらいの目標．
</p>
</div>
</div>
</div>
</body>
</html>
